{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "21e61748",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ТРЕВОГА. ПОКИНУТЬ КОРАБЛЬ.\n",
      "\n",
      "...\n",
      "\n",
      "...\n",
      "\n",
      "...\n",
      "\n",
      "*Вы погрузились в спасательную капсулу и успешно десантировались на планету*\n",
      "\n",
      "\n",
      "Корабль потерпел крушение из-за внезапной космической аномалии, которая повергла его в хаос.\n",
      "\n",
      "Вспышки света, крики и нескончаемый шум разрушения ознаменовали конец вашего судна.\n",
      "\n",
      "Вы — Ибрагим, отважный исследователь и пилот, чей разум всё ещё борется с шоком от произошедшего.\n",
      "\n",
      "В капсуле, где вы сейчас находитесь, пространство тесно и темно, а каждый звук отзывается эхом по холодным металлическим стенам.\n",
      "\n",
      "Вы чувствуете смешанные эмоции: страх, решимость и странное спокойствие, осознавая, что вы ещё живы.\n",
      "\n",
      "Это начало вашего пути к выживанию и поиску спасения.\n",
      "Добро пожаловать в...\n",
      "\n",
      "███████╗██╗  ██╗ ██████╗ ███╗   ███╗ █████╗ ██████╗  ██████╗  ██████╗ ███╗   ██╗███████╗██████╗\n",
      "██╔════╝╚██╗██╔╝██╔═══██╗████╗ ████║██╔══██╗██╔══██╗██╔═══██╗██╔═══██╗████╗  ██║██╔════╝██╔══██╗\n",
      "█████╗   ╚███╔╝ ██║   ██║██╔████╔██║███████║██████╔╝██║   ██║██║   ██║██╔██╗ ██║█████╗  ██║  ██║\n",
      "██╔══╝   ██╔██╗ ██║   ██║██║╚██╔╝██║██╔══██║██╔══██╗██║   ██║██║   ██║██║╚██╗██║██╔══╝  ██║  ██║\n",
      "███████╗██╔╝ ██╗╚██████╔╝██║ ╚═╝ ██║██║  ██║██║  ██║╚██████╔╝╚██████╔╝██║ ╚████║███████╗██████╔╝\n",
      "╚══════╝╚═╝  ╚═╝ ╚═════╝ ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝╚══════╝╚═════╝\n",
      "Вы оказались на неизвестной планете после катастрофы космического корабля.\n",
      "Ваша задача — выжить в условиях ограниченных ресурсов и исследовать окружающую среду, чтобы найти путь к спасению.\n",
      "Каждый день вам предстоит выбирать одно действие из предложенных вариантов.\n",
      "При этом с каждым днем уровень сытости и жажды будет падать на 10%, а ваше состояние будет зависеть от сделанных выборов.\n",
      "Управляйте своим инвентарем, исследуйте территорию и восстанавливайте свою капсулу, чтобы увеличить шансы на выживание и спасение.\n",
      "ДЕНЬ 1\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 80% [████████──]\n",
      "У вас на руках:\n",
      "медь: 0\n",
      "железо: 0\n",
      "водоросли: 0\n",
      "алмазы: 0\n",
      "кораллы: 0\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "ВНИМАНИЕ: У вас нет кислородного баллона для исследования глубоких мест!\n",
      "С каждым действием, которое вы выбираете, вы повышаете шанс своего выживания. Что конкретно делать — остаётся за вами.\n",
      "————————————————————————————————————————————————————\n",
      "Вы можете попытаться в первую очередь выйти наружу или сосредоточиться на анализе состояния своей спасательной капсулы.\n",
      "1. Выйти наружу.\n",
      "2. Исследовать спасательную капсулу.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы начинаете исследовать капсулу.\n",
      "Повреждены: радио, радар, изготовитель аптечек.\n",
      "В попытках починить капсулу вы провели весь день, зачем?\n",
      "у вас нет ресурсов для починки капсулы, попробуйте найти их вне её\n",
      "\n",
      "ДЕНЬ 2\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 70% [███████───]\n",
      "У вас на руках:\n",
      "медь: 0\n",
      "железо: 0\n",
      "водоросли: 0\n",
      "алмазы: 0\n",
      "кораллы: 0\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Возврат в основное меню.\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "\n",
      "Внезапно на вас нападает подводный хищник!\n",
      "У вас не было аптечек, и хищник нанёс вам урон. В борьбе с ним вы потеряли много энергии. Вы потеряли 20% еды.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете собирать ресурсы.\n",
      "Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\n",
      "Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\n",
      "Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\n",
      "1. Собирать камни.\n",
      "2. Нарезать кораллы.\n",
      "3. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько стеблей водорослей.\n",
      "У вас еще есть возможность собрать камни или кораллы.\n",
      "1. Нарезать кораллы.\n",
      "2. Собирать камни.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько пластин коралла.\n",
      "С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\n",
      "Вам удалось поймать рыбу и восстановить 10% запаса еды!\n",
      "Стало темнеть. Пора возвращаться в капсулу.\n",
      "\n",
      "ДЕНЬ 3\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 50% [█████─────]\n",
      "У вас на руках:\n",
      "медь: 0\n",
      "железо: 0\n",
      "водоросли: 2\n",
      "алмазы: 0\n",
      "кораллы: 2\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  8\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы приготовили питательный коктейль из водорослей и восстановили 30% запаса еды!\n",
      "\n",
      "Вы уже использовали крафт. Выберите основное действие на день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете собирать ресурсы.\n",
      "Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\n",
      "Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\n",
      "Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\n",
      "1. Собирать камни.\n",
      "2. Нарезать кораллы.\n",
      "3. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вам удается найти несколько камней, содержащих железо и медь.\n",
      "У вас еще есть возможность собрать водоросли или кораллы.\n",
      "1. Нарезать кораллы.\n",
      "2. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько пластин коралла.\n",
      "С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\n",
      "Вам удалось поймать рыбу и восстановить 22% запаса еды!\n",
      "Стало темнеть. Пора возвращаться в капсулу.\n",
      "\n",
      "ДЕНЬ 4\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 90% [█████████─]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 2\n",
      "водоросли: 0\n",
      "алмазы: 0\n",
      "кораллы: 4\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Кислородный баллон создан! Теперь вы можете исследовать глубоководные места.\n",
      "\n",
      "Вы уже использовали крафт. Выберите основное действие на день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какую систему чинить?\n",
      "1. Радио (1 микросхема, 2 медь, редкие ресурсы)\n",
      "2. Радар (1 микросхема, 2 железо, 1 магнетит)\n",
      "3. Изготовитель аптечек (1 микросхема, 1 синтетические волокна)\n",
      "4. починить капсулу (2 медь, 2 железо, 1 микросхема, 1 алмаз, 1 магнетит, редкие ресурсы)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер:  4\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Недостаточно ресурсов. В попытках хоть что-то исправить или починить вы провели весь день, вам стоит лучше рассчитывать время.\n",
      "\n",
      "ДЕНЬ 5\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 80% [████████──]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 0\n",
      "водоросли: 0\n",
      "алмазы: 0\n",
      "кораллы: 4\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "\n",
      "Внезапно на вас нападает подводный хищник!\n",
      "У вас не было аптечек, и хищник нанёс вам урон. В борьбе с ним вы потеряли много энергии. Вы потеряли 20% еды.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете собирать ресурсы.\n",
      "Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\n",
      "Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\n",
      "Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\n",
      "1. Собирать камни.\n",
      "2. Нарезать кораллы.\n",
      "3. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько стеблей водорослей.\n",
      "У вас еще есть возможность собрать камни или кораллы.\n",
      "1. Нарезать кораллы.\n",
      "2. Собирать камни.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вам удается найти несколько камней, содержащих железо и медь.\n",
      "С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\n",
      "Вам удалось поймать рыбу и восстановить 13% запаса еды!\n",
      "Стало темнеть. Пора возвращаться в капсулу.\n",
      "\n",
      "ДЕНЬ 6\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 63% [██████────]\n",
      "У вас на руках:\n",
      "медь: 4\n",
      "железо: 2\n",
      "водоросли: 2\n",
      "алмазы: 0\n",
      "кораллы: 4\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  6\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "вы успешно переработали водоросли в синтетические волокна!\n",
      "\n",
      "Вы уже использовали крафт. Выберите основное действие на день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какую систему чинить?\n",
      "1. Радио (1 микросхема, 2 медь, редкие ресурсы)\n",
      "2. Радар (1 микросхема, 2 железо, 1 магнетит)\n",
      "3. Изготовитель аптечек (1 микросхема, 1 синтетические волокна)\n",
      "4. починить капсулу (2 медь, 2 железо, 1 микросхема, 1 алмаз, 1 магнетит, редкие ресурсы)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Недостаточно ресурсов. В попытках хоть что-то исправить или починить вы провели весь день, вам стоит лучше рассчитывать время.\n",
      "\n",
      "ДЕНЬ 7\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 53% [█████─────]\n",
      "У вас на руках:\n",
      "медь: 4\n",
      "железо: 2\n",
      "водоросли: 0\n",
      "алмазы: 0\n",
      "кораллы: 4\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 1\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете собирать ресурсы.\n",
      "Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\n",
      "Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\n",
      "Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\n",
      "1. Собирать камни.\n",
      "2. Нарезать кораллы.\n",
      "3. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько пластин коралла.\n",
      "У вас еще есть возможность собрать водоросли или камни.\n",
      "1. Собирать камни.\n",
      "2. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько стеблей водорослей.\n",
      "С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\n",
      "Вам удалось поймать рыбу и восстановить 13% запаса еды!\n",
      "Стало темнеть. Пора возвращаться в капсулу.\n",
      "\n",
      "ДЕНЬ 8\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов), изготовитель аптечек\n",
      "Состояние сытости/жажды: 56% [█████─────]\n",
      "У вас на руках:\n",
      "медь: 4\n",
      "железо: 2\n",
      "водоросли: 2\n",
      "алмазы: 0\n",
      "кораллы: 6\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 1\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Микросхема создана!\n",
      "\n",
      "Вы уже использовали крафт. Выберите основное действие на день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какую систему чинить?\n",
      "1. Радио (1 микросхема, 2 медь, редкие ресурсы)\n",
      "2. Радар (1 микросхема, 2 железо, 1 магнетит)\n",
      "3. Изготовитель аптечек (1 микросхема, 1 синтетические волокна)\n",
      "4. починить капсулу (2 медь, 2 железо, 1 микросхема, 1 алмаз, 1 магнетит, редкие ресурсы)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Изготовитель аптечек отремонтирован!\n",
      "\n",
      "ДЕНЬ 9\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 46% [████──────]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 2\n",
      "водоросли: 2\n",
      "алмазы: 0\n",
      "кораллы: 4\n",
      "магнетит: 0\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 0\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Нож создан! Он может пригодиться в будущем.\n",
      "\n",
      "Вы уже использовали крафт. Выберите основное действие на день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы решаете изучить местность вокруг.\n",
      "Вы замечаете, что некоторые растения испускают слабое свечение, а мелкие рыбки не боятся вас.\n",
      "Вдали вы замечаете нечто интересное — возможно, вход в подводную пещеру.\n",
      "1. Исследовать\n",
      "2. Вернуться в капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы подплываете ближе.\n",
      "С кислородным баллоном вы погружаетесь и находите пещеру с ресурсами.\n",
      "В глубине пещеры обитает крупный хищник.\n",
      "у вас всё ещё есть возможность вернуться.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "1. Вернуться домой(скорее всего перед встречей с хищником может понадобиться обзавестись оружием)\n",
      "2. Рискнуть 2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы спускаетесь в пещеру.\n",
      "Вам удаётся убить хищника и собрать немного ресурсов со дна пещеры.\n",
      "Вы разделали тушу хищника и смогли добыть пищи, восстановив 27% запаса еды!\n",
      "День подошёл к концу.\n",
      "\n",
      "ДЕНЬ 10\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 63% [██████────]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 0\n",
      "водоросли: 2\n",
      "алмазы: 1\n",
      "кораллы: 4\n",
      "магнетит: 1\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 1\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "Вы ощущаете признаки незнакомого заболевания, возможно, вы больны\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какую систему чинить?\n",
      "1. Радио (1 микросхема, 2 медь, редкие ресурсы)\n",
      "2. Радар (1 микросхема, 2 железо, 1 магнетит)\n",
      "3. Изготовитель аптечек (1 микросхема, 1 синтетические волокна)\n",
      "4. починить капсулу (2 медь, 2 железо, 1 микросхема, 1 алмаз, 1 магнетит, редкие ресурсы)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Радар функционирует!\n",
      "\n",
      "ДЕНЬ 11\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 53% [█████─────]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 0\n",
      "водоросли: 2\n",
      "алмазы: 1\n",
      "кораллы: 4\n",
      "магнетит: 1\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 1\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете собирать ресурсы.\n",
      "Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\n",
      "Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\n",
      "Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\n",
      "1. Собирать камни.\n",
      "2. Нарезать кораллы.\n",
      "3. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вам удается найти несколько камней, содержащих железо и медь.\n",
      "У вас еще есть возможность собрать водоросли или кораллы.\n",
      "1. Нарезать кораллы.\n",
      "2. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько пластин коралла.\n",
      "С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\n",
      "Вам удалось поймать рыбу и восстановить 11% запаса еды!\n",
      "Стало темнеть. Пора возвращаться в капсулу.\n",
      "\n",
      "ДЕНЬ 12\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 54% [█████─────]\n",
      "У вас на руках:\n",
      "медь: 4\n",
      "железо: 2\n",
      "водоросли: 2\n",
      "алмазы: 1\n",
      "кораллы: 6\n",
      "магнетит: 1\n",
      "редкие ресурсы: 0\n",
      "микросхема: 0\n",
      "синтетические волокна: 0\n",
      "нож: 1\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Микросхема создана!\n",
      "\n",
      "Вы уже использовали крафт. Выберите основное действие на день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы решаете изучить местность вокруг.\n",
      "Вы замечаете, что некоторые растения испускают слабое свечение, а мелкие рыбки не боятся вас.\n",
      "Вдали вы замечаете нечто интересное — возможно, вход в подводную пещеру.\n",
      "1. Исследовать\n",
      "2. Вернуться в капсулу\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы подплываете ближе.\n",
      "С кислородным баллоном вы погружаетесь и находите пещеру с ресурсами.\n",
      "В глубине пещеры обитает крупный хищник.\n",
      "у вас всё ещё есть возможность вернуться.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "1. Вернуться домой(скорее всего перед встречей с хищником может понадобиться обзавестись оружием)\n",
      "2. Рискнуть 2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы спускаетесь в пещеру.\n",
      "Вам удаётся убить хищника и собрать немного ресурсов со дна пещеры.\n",
      "Вы разделали тушу хищника и смогли добыть пищи, восстановив 34% запаса еды!\n",
      "День подошёл к концу.\n",
      "\n",
      "ДЕНЬ 13\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 78% [███████───]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 2\n",
      "водоросли: 2\n",
      "алмазы: 2\n",
      "кораллы: 4\n",
      "магнетит: 2\n",
      "редкие ресурсы: 0\n",
      "микросхема: 1\n",
      "синтетические волокна: 0\n",
      "нож: 1\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Какую систему чинить?\n",
      "1. Радио (1 микросхема, 2 медь, редкие ресурсы)\n",
      "2. Радар (1 микросхема, 2 железо, 1 магнетит)\n",
      "3. Изготовитель аптечек (1 микросхема, 1 синтетические волокна)\n",
      "4. починить капсулу (2 медь, 2 железо, 1 микросхема, 1 алмаз, 1 магнетит, редкие ресурсы)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Радар функционирует!\n",
      "\n",
      "ДЕНЬ 14\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 68% [██████────]\n",
      "У вас на руках:\n",
      "медь: 2\n",
      "железо: 2\n",
      "водоросли: 2\n",
      "алмазы: 2\n",
      "кораллы: 4\n",
      "магнетит: 2\n",
      "редкие ресурсы: 0\n",
      "микросхема: 1\n",
      "синтетические волокна: 0\n",
      "нож: 1\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете исследовать местность.\n",
      "Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\n",
      "1. Изучать местность.\n",
      "2. Собирать ресурсы\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Вы решаете собирать ресурсы.\n",
      "Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\n",
      "Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\n",
      "Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\n",
      "1. Собирать камни.\n",
      "2. Нарезать кораллы.\n",
      "3. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  1\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вам удается найти несколько камней, содержащих железо и медь.\n",
      "У вас еще есть возможность собрать водоросли или кораллы.\n",
      "1. Нарезать кораллы.\n",
      "2. Поплыть за водорослями.\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вы успешно срезаете несколько стеблей водорослей.\n",
      "С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\n",
      "Вам удалось поймать рыбу и восстановить 25% запаса еды!\n",
      "Стало темнеть. Пора возвращаться в капсулу.\n",
      "\n",
      "ДЕНЬ 15\n",
      "————————————————————————————————————————————————————\n",
      "Статус капсулы: сломана.\n",
      "Требуют починки: радио, радар(необходим для поиска редких ресурсов)\n",
      "Состояние сытости/жажды: 83% [████████──]\n",
      "У вас на руках:\n",
      "медь: 4\n",
      "железо: 4\n",
      "водоросли: 4\n",
      "алмазы: 2\n",
      "кораллы: 4\n",
      "магнетит: 2\n",
      "редкие ресурсы: 0\n",
      "микросхема: 1\n",
      "синтетические волокна: 0\n",
      "нож: 1\n",
      "острый раскалённый нож: 0\n",
      "аптечки: 0\n",
      "Мутации, вызванные биосферой планеты приобрели необратимый характер, вас уже не спасти((\n",
      "\n",
      "Вы можете совершить одно действие за день:\n",
      "1. Исследовать окрестности капсулы\n",
      "2. Попытаться починить капсулу\n",
      "3. Создать предмет (не тратит день)\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер действия:  3\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что создать?\n",
      "1. Микросхема (2 коралла, 2 меди)\n",
      "2. Кислородный баллон (2 железа)\n",
      "3. Нож (2 железа)\n",
      "4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\n",
      "5. Аптечки (1 синтетическое волокно)\n",
      "6. Переработать водоросли в волокна (2 водоросли)\n",
      "7. Жареная рыба (1 водоросль) - восстановит 20% еды\n",
      "8. Питательный коктейль (2 водоросли) - восстановит 30% еды\n",
      "9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\n",
      "0. Вернуться назад.\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "Interrupted by user",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[1], line 798\u001b[0m\n\u001b[1;32m    795\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25\u001b[39m\u001b[38;5;124m%\u001b[39m\u001b[38;5;124m еды\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    796\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m0. Вернуться назад.\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m--> 798\u001b[0m craft_choice \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43minput\u001b[39;49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mВведите номер (0 - для возврата): \u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[38;5;241m.\u001b[39mstrip()\n\u001b[1;32m    799\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m craft_choice \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m0\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[1;32m    800\u001b[0m     \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mВозврат в основное меню.\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[0;32m~/.local/share/pipx/venvs/notebook/lib/python3.12/site-packages/ipykernel/kernelbase.py:1282\u001b[0m, in \u001b[0;36mKernel.raw_input\u001b[0;34m(self, prompt)\u001b[0m\n\u001b[1;32m   1280\u001b[0m     msg \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mraw_input was called, but this frontend does not support input requests.\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m   1281\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m StdinNotImplementedError(msg)\n\u001b[0;32m-> 1282\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_input_request\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m   1283\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mstr\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m   1284\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_parent_ident\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mshell\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m   1285\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget_parent\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mshell\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m   1286\u001b[0m \u001b[43m    \u001b[49m\u001b[43mpassword\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43;01mFalse\u001b[39;49;00m\u001b[43m,\u001b[49m\n\u001b[1;32m   1287\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/.local/share/pipx/venvs/notebook/lib/python3.12/site-packages/ipykernel/kernelbase.py:1325\u001b[0m, in \u001b[0;36mKernel._input_request\u001b[0;34m(self, prompt, ident, parent, password)\u001b[0m\n\u001b[1;32m   1322\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m:\n\u001b[1;32m   1323\u001b[0m     \u001b[38;5;66;03m# re-raise KeyboardInterrupt, to truncate traceback\u001b[39;00m\n\u001b[1;32m   1324\u001b[0m     msg \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mInterrupted by user\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m-> 1325\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m(msg) \u001b[38;5;28;01mfrom\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[1;32m   1326\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mException\u001b[39;00m:\n\u001b[1;32m   1327\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mlog\u001b[38;5;241m.\u001b[39mwarning(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mInvalid Message:\u001b[39m\u001b[38;5;124m\"\u001b[39m, exc_info\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m)\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: Interrupted by user"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите номер (0 - для возврата):  0\n"
     ]
    }
   ],
   "source": [
    "# на всякий случай, ещё раз: в юпитере НЕ функционируют операторы exit() и quit(), так что не удивляйтесь, что после смерти игра продолжится\n",
    "\n",
    "import random\n",
    "\n",
    "# создаём искусственную задержку в игре: выполняет пустой цикл указанное количество раз\n",
    "def busy_wait(delay_count):\n",
    "    for _ in range(delay_count):\n",
    "        pass\n",
    "\n",
    "# Создаём визуальную шкалу отображения уровня сытости\n",
    "def food_bar(food_value):\n",
    "    if food_value >= 100:\n",
    "        return \"[██████████]\"\n",
    "    elif food_value >= 90:\n",
    "        return \"[█████████─]\"\n",
    "    elif food_value >= 80:\n",
    "        return \"[████████──]\"\n",
    "    elif food_value >= 70:\n",
    "        return \"[███████───]\"\n",
    "    elif food_value >= 60:\n",
    "        return \"[██████────]\"\n",
    "    elif food_value >= 50:\n",
    "        return \"[█████─────]\"\n",
    "    elif food_value >= 40:\n",
    "        return \"[████──────]\"\n",
    "    elif food_value >= 30:\n",
    "        return \"[███───────]\"\n",
    "    elif food_value >= 20:\n",
    "        return \"[██────────]\"\n",
    "    elif food_value >= 10:\n",
    "        return \"[█─────────]\"\n",
    "    else:\n",
    "        return \"[──────────]\"\n",
    "\n",
    "# Переменная для отслеживания текущего дня в игре\n",
    "day = 0\n",
    "\n",
    "# Функция форматирует инвентарь игрока для вывода на экран, преобразуя словарь в строки вида \"[ресурс]: [количество]\"\n",
    "def resources(dictt):\n",
    "    result = []\n",
    "    for key, value in dictt.items():\n",
    "        if key != \"sekretik\": # про секретик расскажет Дениска\n",
    "            result.append(f\"{key}: {value}\")\n",
    "    return \"\\n\".join(result)\n",
    "\n",
    "# Эту функцию включаем каждый раз, когда начинается новый день:\n",
    "# 1) обновляются переменная дня и уровень еды\n",
    "# 2) выводится инфа о состоянии инвентаря и доп. инфа в зависимости от дня\n",
    "def day_change(day):\n",
    "    day += 1\n",
    "    player_state[\"food\"] -= 10\n",
    "    if player_state[\"food\"] <= 0:\n",
    "        print(\"\\nКажется, вы забыли, что человеку нужно получать калории. Вы умерли от голода. Игра окончена.\")\n",
    "        exit()\n",
    "\n",
    "     # Выводим информацию о новом дне\n",
    "    print(f\"\\nДЕНЬ {day}\\n————————————————————————————————————————————————————\")\n",
    "    print(\"Статус капсулы: \" + player_state[\"capsule_status\"][\"status\"])\n",
    "    busy_wait(40000000)\n",
    "    print(\"Требуют починки: \" + \", \".join(player_state[\"capsule_status\"][\"requires_repairs\"]))\n",
    "    busy_wait(40000000)\n",
    "    print(f\"Состояние сытости/жажды: {player_state['food']}% {food_bar(player_state['food'])}\")\n",
    "    busy_wait(40000000)\n",
    "    if player_state[\"inventory\"]:\n",
    "        print(f\"У вас на руках:\\n{resources(spisok_resursov)}\")\n",
    "    else:\n",
    "        print(\"На данный момент в вашем инвентаре ничего нет.\")\n",
    "    busy_wait(40000000)\n",
    "    \n",
    "    if \"oxygen_tank\" in player_state and not player_state[\"oxygen_tank\"] and day == 1:\n",
    "        print(\"\\nВНИМАНИЕ: У вас нет кислородного баллона для исследования глубоких мест!\")\n",
    "    busy_wait(40000000)\n",
    "\n",
    "    if day == 10:\n",
    "        print(\"Вы ощущаете признаки незнакомого заболевания, возможно, вы больны\")\n",
    "    if day == 15:\n",
    "        print(\"Мутации, вызванные биосферой планеты приобрели необратимый характер, вас уже не спасти((\")\n",
    "        exit()\n",
    "    return day\n",
    "\n",
    "# Функция для крафта предметов\n",
    "def craft_item(item):\n",
    "    # Словарь с рецептами крафта: для каждого предмета указаны необходимые ресурсы\n",
    "    # это работает так: у нас есть словарь crafts, а значения ключей этого словаря — ещё один словарь\n",
    "\n",
    "    crafts = {\n",
    "        \"микросхема\": {\"кораллы\": 2, \"медь\": 2},\n",
    "        \"кисл баллон высокой ёмкости\": {\"железо\": 2},\n",
    "        \"нож\": {\"железо\": 2},\n",
    "        \"острый раскалённый нож\": {\"нож\": 1, \"алмазы\": 1, \"микросхема\": 1},\n",
    "        \"аптечки\": {\"синтетические волокна\": 1},\n",
    "        \"синтетические волокна\": {\"водоросли\": 2},\n",
    "        \"жареная рыба\": {\"водоросли\": 1},\n",
    "        \"питательный коктейль\": {\"водоросли\": 2},\n",
    "        \"консервы из морепродуктов\": {\"водоросли\": 1, \"нож\": 0}\n",
    "    }\n",
    "    if item in crafts: # на всякий случай проверяем наличие предмета в словаре\n",
    "\n",
    "        required = crafts[item] # если предмет найден, получаем его рецепт из словаря\n",
    "\n",
    "        # первый случай: ресурсов не хватает\n",
    "        for resource, amount in required.items(): # resource = ключи вложенного словаря, а amount = требуемое количество\n",
    "            if spisok_resursov.get(resource, 0) < amount: # получаем количество ресурсов у игрока\n",
    "                # метод .get() используется, чтобы вернуть 0, если одного или более ресуров нет в инвентаре\n",
    "                print(f\"Недостаточно {resource} для создания {item}.\")\n",
    "                return False # Возвращаем False, чтобы показать, что крафт невозможен\n",
    "\n",
    "         # второй случай: ресурсов хватает\n",
    "        for resource, amount in required.items():\n",
    "            if resource == \"нож\" and item == \"консервы из морепродуктов\":\n",
    "                pass # оператор pass гарантирует, что действие пройдёт, но нож останется (ибо нож не ломается при готовке консерв)\n",
    "            else:\n",
    "                spisok_resursov[resource] -= amount\n",
    "                \n",
    "        if item == \"микросхема\":\n",
    "            spisok_resursov[\"микросхема\"] = spisok_resursov.get(\"микросхема\", 0) + 1\n",
    "            print(\"Микросхема создана!\")\n",
    "        elif item == \"кисл баллон высокой ёмкости\":\n",
    "            player_state[\"oxygen_tank\"] = True\n",
    "            print(\"Кислородный баллон создан! Теперь вы можете исследовать глубоководные места.\")\n",
    "        elif item == \"нож\":\n",
    "            spisok_resursov[\"нож\"] = spisok_resursov.get(\"нож\", 0) + 1\n",
    "            print(\"Нож создан! Он может пригодиться в будущем.\")\n",
    "        elif item == \"острый раскалённый нож\":\n",
    "            spisok_resursov[\"острый раскалённый нож\"] = spisok_resursov.get(\"острый раскалённый нож\", 0) + 1\n",
    "            print(\"Острый раскалённый нож создан!\")\n",
    "        elif item == \"аптечки\":\n",
    "            if \"изготовитель аптечек\" in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                print(\"вы не можете создать аптечку, пока изготовитель аптечек не функционирует\")\n",
    "                return False\n",
    "            else:\n",
    "                spisok_resursov[\"аптечки\"] = spisok_resursov.get(\"аптечки\", 0) + 1\n",
    "                print(\"Аптечка создана! Она поможет при встрече с хищником.\")\n",
    "        elif item == \"синтетические волокна\":\n",
    "            spisok_resursov[\"синтетические волокна\"] = spisok_resursov.get(\"синтетические волокна\", 0) + 1\n",
    "            print(\"вы успешно переработали водоросли в синтетические волокна!\")\n",
    "        elif item == \"жареная рыба\":\n",
    "            player_state[\"food\"] += 20\n",
    "            if player_state[\"food\"] > 100:\n",
    "                player_state[\"food\"] = 100\n",
    "            print(\"Вы приготовили жареную рыбу и восстановили 20% запаса еды!\")\n",
    "        elif item == \"питательный коктейль\":\n",
    "            player_state[\"food\"] += 30\n",
    "            if player_state[\"food\"] > 100:\n",
    "                player_state[\"food\"] = 100\n",
    "            print(\"Вы приготовили питательный коктейль из водорослей и восстановили 30% запаса еды!\")\n",
    "        elif item == \"консервы из морепродуктов\":\n",
    "            player_state[\"food\"] += 25\n",
    "            if player_state[\"food\"] > 100:\n",
    "                player_state[\"food\"] = 100\n",
    "            print(\"Вы приготовили консервы из морепродуктов и восстановили 25% запаса еды!\")\n",
    "        return True\n",
    "    else:\n",
    "        print(\"Такого предмета нельзя создать.\")\n",
    "        return False\n",
    "\n",
    "player_state = {\n",
    "    \"capsule_status\": {\n",
    "        \"status\": \"сломана.\",\n",
    "        \"requires_repairs\": [\"радио\", \"радар(необходим для поиска редких ресурсов)\", \"изготовитель аптечек\"]\n",
    "    },\n",
    "    \"food\": 90,\n",
    "    \"inventory\": {},\n",
    "    \"oxygen_tank\": False, # проверяем, есть ли кислородный баллон\n",
    "    \"has_visited_cave\": False # проверяем, заплывал ли уже Олег в пещеру\n",
    "}\n",
    "\n",
    "spisok_resursov = { # непосредственно список ресурсов Олега\n",
    "    \"медь\": 0,\n",
    "    \"железо\": 0,\n",
    "    \"водоросли\": 0,\n",
    "    \"алмазы\": 0,\n",
    "    \"кораллы\": 0,\n",
    "    \"магнетит\": 0,\n",
    "    \"редкие ресурсы\": 0,\n",
    "    \"микросхема\": 0,\n",
    "    \"синтетические волокна\": 0,\n",
    "    \"нож\": 0,\n",
    "    \"острый раскалённый нож\": 0,\n",
    "    \"аптечки\": 0,\n",
    "    \"sekretik\": \";)\"\n",
    "}\n",
    "\n",
    "player_state[\"inventory\"] = spisok_resursov\n",
    "\n",
    "item_kill = 0 # готовим сюрприз игроку\n",
    "\n",
    "print(\"ТРЕВОГА. ПОКИНУТЬ КОРАБЛЬ.\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\n...\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\n...\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\n...\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\n*Вы погрузились в спасательную капсулу и успешно десантировались на планету*\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\n\\nКорабль потерпел крушение из-за внезапной космической аномалии, которая повергла его в хаос.\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\nВспышки света, крики и нескончаемый шум разрушения ознаменовали конец вашего судна.\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\nВы — Ибрагим, отважный исследователь и пилот, чей разум всё ещё борется с шоком от произошедшего.\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\nВ капсуле, где вы сейчас находитесь, пространство тесно и темно, а каждый звук отзывается эхом по холодным металлическим стенам.\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\nВы чувствуете смешанные эмоции: страх, решимость и странное спокойствие, осознавая, что вы ещё живы.\")\n",
    "busy_wait(70000000)\n",
    "print(\"\\nЭто начало вашего пути к выживанию и поиску спасения.\")\n",
    "busy_wait(70000000)\n",
    "print(\"Добро пожаловать в...\")\n",
    "busy_wait(50000000)\n",
    "print(\"\\n███████╗██╗  ██╗ ██████╗ ███╗   ███╗ █████╗ ██████╗  ██████╗  ██████╗ ███╗   ██╗███████╗██████╗\")\n",
    "busy_wait(40000000)\n",
    "print(\"██╔════╝╚██╗██╔╝██╔═══██╗████╗ ████║██╔══██╗██╔══██╗██╔═══██╗██╔═══██╗████╗  ██║██╔════╝██╔══██╗\")\n",
    "busy_wait(40000000)\n",
    "print(\"█████╗   ╚███╔╝ ██║   ██║██╔████╔██║███████║██████╔╝██║   ██║██║   ██║██╔██╗ ██║█████╗  ██║  ██║\")\n",
    "busy_wait(40000000)\n",
    "print(\"██╔══╝   ██╔██╗ ██║   ██║██║╚██╔╝██║██╔══██║██╔══██╗██║   ██║██║   ██║██║╚██╗██║██╔══╝  ██║  ██║\")\n",
    "busy_wait(40000000)\n",
    "print(\"███████╗██╔╝ ██╗╚██████╔╝██║ ╚═╝ ██║██║  ██║██║  ██║╚██████╔╝╚██████╔╝██║ ╚████║███████╗██████╔╝\")\n",
    "busy_wait(40000000)\n",
    "print(\"╚══════╝╚═╝  ╚═╝ ╚═════╝ ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝╚══════╝╚═════╝\")\n",
    "busy_wait(50000000)\n",
    "print(\"Вы оказались на неизвестной планете после катастрофы космического корабля.\", end=\"\", flush=True)\n",
    "busy_wait(100000000)\n",
    "print(\"\\nВаша задача — выжить в условиях ограниченных ресурсов и исследовать окружающую среду, чтобы найти путь к спасению.\", end=\"\", flush=True)\n",
    "busy_wait(100000000)\n",
    "print(\"\\nКаждый день вам предстоит выбирать одно действие из предложенных вариантов.\", end=\"\", flush=True)\n",
    "busy_wait(100000000)\n",
    "print(\"\\nПри этом с каждым днем уровень сытости и жажды будет падать на 10%, а ваше состояние будет зависеть от сделанных выборов.\", end=\"\", flush=True)\n",
    "busy_wait(100000000)\n",
    "print(\"\\nУправляйте своим инвентарем, исследуйте территорию и восстанавливайте свою капсулу, чтобы увеличить шансы на выживание и спасение.\", end=\"\", flush=True)\n",
    "busy_wait(100000000)\n",
    "\n",
    "day = day_change(day)\n",
    "busy_wait(100000000)\n",
    "print(\"С каждым действием, которое вы выбираете, вы повышаете шанс своего выживания. Что конкретно делать — остаётся за вами.\")\n",
    "busy_wait(40000000)\n",
    "print(\"————————————————————————————————————————————————————\")\n",
    "busy_wait(100000000)\n",
    "print(\"Вы можете попытаться в первую очередь выйти наружу или сосредоточиться на анализе состояния своей спасательной капсулы.\")\n",
    "busy_wait(40000000)\n",
    "print(\"1. Выйти наружу.\")\n",
    "busy_wait(40000000)\n",
    "print(\"2. Исследовать спасательную капсулу.\")\n",
    "busy_wait(100000000)\n",
    "\n",
    "while True:\n",
    "    choice = input(\"Введите номер действия: \").strip()\n",
    "    while choice not in {\"1\", \"2\"}:\n",
    "        choice = input(\"Неверный выбор. Введите 1 или 2: \").strip()\n",
    "\n",
    "    if choice == \"1\": # идём наружу\n",
    "        print(\"\\nВы решаете исследовать местность.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"Осторожно выходя из капсулы, вы ощущаете плотность воды, окружающей вас. Вокруг разрастаются странные морские растения, а вдалеке виднеются силуэты неизвестных существ.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"На видимом горизонте вы замечаете, что рядом с капсулой вода относительно мелкая. Это как никогда полезно, ведь таким образом у вас получается заполучить немалое количество ресурсов.\")\n",
    "        busy_wait(40000000)\n",
    "        \n",
    "        if random.random() < 0.2:  # с шансом 1 к 5 нас может атаковать хищник\n",
    "            print(\"\\nВнезапно на вас нападает подводный хищник!\")\n",
    "            if spisok_resursov[\"аптечки\"] > 0:\n",
    "                spisok_resursov[\"аптечки\"] -= 1\n",
    "                print(\"Вы использовали аптечку и избежали урона.\")\n",
    "            else:\n",
    "                player_state[\"food\"] -= 20\n",
    "                print(\"У вас не было аптечек, и хищник нанёс вам урон. В борьбе с ним вы потеряли много энергии. Вы потеряли 20% еды.\")\n",
    "                if player_state[\"food\"] <= 0:\n",
    "                    print(\"В борьбе с хищником вы потеряли много энергии. Вы умерли от недостатка сил после атаки. Игра окончена.\")\n",
    "                    exit()\n",
    "\n",
    "        # второй выбор: что делать после выхода наружу\n",
    "        print(\"Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"1. Изучать местность.\\n2. Собирать ресурсы\")\n",
    "            \n",
    "        while True: # Выбор: собирать ресы или исследовать местность\n",
    "            inner_choice = input(\"Введите номер действия: \").strip()\n",
    "            if inner_choice == \"2\":\n",
    "                print(\"\\nВы решаете собирать ресурсы.\") # если решили собирать ресы\n",
    "                busy_wait(40000000)\n",
    "                print(\"Вокруг, на дне и на склонах подземных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"1. Собирать камни.\\n2. Нарезать кораллы.\\n3. Поплыть за водорослями.\")\n",
    "                while True:\n",
    "                    second_inner_choice = input(\"Введите номер действия: \").strip()\n",
    "                    if second_inner_choice == \"1\":\n",
    "                        print(\"Вам удается найти несколько камней, содержащих железо и медь.\")\n",
    "                        spisok_resursov[\"медь\"] += 2\n",
    "                        spisok_resursov[\"железо\"] += 2\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"У вас еще есть возможность собрать водоросли или кораллы.\")\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"1. Нарезать кораллы.\\n2. Поплыть за водорослями.\")\n",
    "                        while True:\n",
    "                            third_inner_choice = input(\"Введите номер действия: \").strip()\n",
    "                            if third_inner_choice == \"1\":\n",
    "                                print(\"Вы успешно срезаете несколько пластин коралла.\")\n",
    "                                spisok_resursov[\"кораллы\"] += 2\n",
    "                                busy_wait(40000000)\n",
    "                                break\n",
    "                            elif third_inner_choice == \"2\":\n",
    "                                print(\"Вы успешно срезаете несколько стеблей водорослей.\")\n",
    "                                spisok_resursov[\"водоросли\"] += 2\n",
    "                                busy_wait(40000000)\n",
    "                                break\n",
    "                            else:\n",
    "                                print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                    elif second_inner_choice == \"2\":\n",
    "                        print(\"Вы успешно срезаете несколько пластин коралла.\")\n",
    "                        spisok_resursov[\"кораллы\"] += 2\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"У вас еще есть возможность собрать водоросли или камни.\")\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"1. Собирать камни.\\n2. Поплыть за водорослями.\")\n",
    "                        while True:\n",
    "                            fourth_inner_choice = input(\"Введите номер действия: \").strip()\n",
    "                            if fourth_inner_choice == \"1\":\n",
    "                                print(\"Вам удается найти несколько камней, содержащих железо и медь.\")\n",
    "                                spisok_resursov[\"медь\"] += 2\n",
    "                                spisok_resursov[\"железо\"] += 2\n",
    "                                busy_wait(40000000)\n",
    "                                break\n",
    "                            elif fourth_inner_choice == \"2\":\n",
    "                                print(\"Вы успешно срезаете несколько стеблей водорослей.\")\n",
    "                                spisok_resursov[\"водоросли\"] += 2\n",
    "                                busy_wait(40000000)\n",
    "                                break\n",
    "                            else:\n",
    "                                print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                    elif second_inner_choice == \"3\":\n",
    "                        print(\"Вы успешно срезаете несколько стеблей водорослей.\")\n",
    "                        spisok_resursov[\"водоросли\"] += 2\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"У вас еще есть возможность собрать камни или кораллы.\")\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"1. Нарезать кораллы.\\n2. Собирать камни.\")\n",
    "                        while True:\n",
    "                            fifth_inner_choice = input(\"Введите номер действия: \").strip()\n",
    "                            if fifth_inner_choice == \"1\":\n",
    "                                print(\"Вы успешно срезаете несколько пластин коралла.\")\n",
    "                                spisok_resursov[\"кораллы\"] += 2\n",
    "                                busy_wait(40000000)\n",
    "                                break\n",
    "                            elif fifth_inner_choice == \"2\":\n",
    "                                print(\"Вам удается найти несколько камней, содержащих железо и медь.\")\n",
    "                                spisok_resursov[\"медь\"] += 2\n",
    "                                spisok_resursov[\"железо\"] += 2\n",
    "                                busy_wait(40000000)\n",
    "                                break\n",
    "                            else:\n",
    "                                print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                    else:\n",
    "                        print('Ошибка ввода. Введите \"1\", \"2\" или \"3\".')\n",
    "                        continue\n",
    "                    break\n",
    "                print(\"С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\")\n",
    "                busy_wait(40000000)\n",
    "                \n",
    "                food_found = random.randint(10, 25) # если собираем водоросли, то заодно ловим рыбок и получаем от 10 до 25% еды\n",
    "                player_state[\"food\"] += food_found\n",
    "                if player_state[\"food\"] > 100:\n",
    "                    player_state[\"food\"] = 100\n",
    "                print(f\"Вам удалось поймать рыбу и восстановить {food_found}% запаса еды!\")\n",
    "                busy_wait(40000000)\n",
    "                \n",
    "                print(\"Стало темнеть. Пора возвращаться в капсулу.\")\n",
    "                busy_wait(100000000)\n",
    "                break\n",
    "            elif inner_choice == \"1\": # если выбрали исследовать местность\n",
    "                print(\"Вы решаете изучить местность вокруг.\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"Вы замечаете, что некоторые растения испускают слабое свечение, а мелкие рыбки не боятся вас.\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"Вдали вы замечаете нечто интересное — возможно, вход в подводную пещеру.\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"1. Исследовать\\n2. Вернуться в капсулу\")\n",
    "                investigate_choice = input(\"Введите номер действия: \").strip()\n",
    "                if investigate_choice == \"1\":\n",
    "                    print(\"Вы подплываете ближе.\")\n",
    "                    busy_wait(40000000)\n",
    "                    if player_state[\"oxygen_tank\"]:\n",
    "                        print(\"С кислородным баллоном вы погружаетесь и находите пещеру.\")\n",
    "                        busy_wait(40000000)\n",
    "                        \n",
    "                        if random.random() < 0.5:\n",
    "                            food_found = random.randint(15, 30)\n",
    "                            player_state[\"food\"] += food_found\n",
    "                            if player_state[\"food\"] > 100:\n",
    "                                player_state[\"food\"] = 100\n",
    "                            print(f\"В пещере вы обнаружили редких морских обитателей и смогли добыть пищу, восстановив {food_found}% запаса еды!\")\n",
    "                            busy_wait(40000000)\n",
    "                    else:\n",
    "                        print(\"Без кислородного баллона вы не можете дышать под водой.\")\n",
    "                        busy_wait(40000000)\n",
    "                        print(\"Вы теряете сознание и умираете. Игра окончена.\")\n",
    "                        exit()\n",
    "                elif investigate_choice == \"2\":\n",
    "                    print(\"Вы возвращаетесь в капсулу.\")\n",
    "                    busy_wait(40000000)\n",
    "                print(\"День подошёл к концу.\")\n",
    "                busy_wait(100000000)\n",
    "                break\n",
    "            else:\n",
    "                print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "        break\n",
    "                    # здесь заканчивается цикл если выбираем выйти наружу\n",
    "    elif choice == \"2\":\n",
    "        print(\"\\nВы начинаете исследовать капсулу.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"Повреждены: радио, радар, изготовитель аптечек.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"В попытках починить капсулу вы провели весь день, зачем?\") # троллинг игрока\n",
    "        busy_wait(40000000)\n",
    "        print(\"у вас нет ресурсов для починки капсулы, попробуйте найти их вне её\")\n",
    "        break\n",
    "        \n",
    "while True:\n",
    "    day = day_change(day)\n",
    "    if item_kill == 4: # сюрприз для игрока\n",
    "        busy_wait(40000000)\n",
    "        print(\"вы просыпаетесь от сильной тряски, кажется, будто само небо разверглось.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"похоже тряска изходит откуда-то из глубин океана.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"вам становится непосебе, однако любопытство побеждает и вы решаете взглянуть на источник шума.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"выйдя из капсулы отплыв немного вы замечаете огромную пропасть, которой раньше не было.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"пропасть росла и вы захотели одним глазком посмотреть внутрь.\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"оттуда что-то поднималось...\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"через несколько мгновений перед вами явилось огромное неописуемое существо...\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"1. что...\")\n",
    "        print(\"2. С!«W2Єџз,hBU*«ЂV*Vія‚&]ИVќs‡—jія‚&Q;PxН•»TН\")\n",
    "        while True:\n",
    "            chto = input()\n",
    "            if chto == 1:\n",
    "                print(\"。。。\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"。。。\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"。。。\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"。。。\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"。。。\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"4–{®†Ґв№†Ў=°Т$ГЦ,ЂС¬лHЙ…Юse0л14'ПC\\Е‡lмАХЎ*ХФ ЧXХъVГ%FџЉР¶jQ d™m: -v`i›џCP ЁЖl1ма—8ЂЦsщf¬ЇЧЏ#ызcj$AOЖ PЎ†ж\")\n",
    "                busy_wait(40000000)\n",
    "                print(\"Эм... похоже вы сошли с ума?\")\n",
    "                exit()\n",
    "            elif chto == 2:\n",
    "                print(\"Кажется, вы сошли с ума?\")\n",
    "                exit() # увы\n",
    "            else:\n",
    "                print(\"К сожалению, необходимо выбрать какой - то из двух вариантов, в такой ситуации, ничего другое вы сказать физически не можете\")\n",
    "    \n",
    "    # через эту переменную отслеживаем, был ли совершён крафт в текущий день\n",
    "    crafting_used = False\n",
    "    \n",
    "    while True:\n",
    "        if not crafting_used:\n",
    "            print(\"\\nВы можете совершить одно действие за день:\")\n",
    "        else:\n",
    "            print(\"\\nВы уже использовали крафт. Выберите основное действие на день:\")\n",
    "        \n",
    "        busy_wait(40000000)\n",
    "        print(\"1. Исследовать окрестности капсулы\")\n",
    "        busy_wait(40000000)\n",
    "        print(\"2. Попытаться починить капсулу\")\n",
    "        busy_wait(40000000)\n",
    "\n",
    "        # мы можем крафтить единожды в день\n",
    "        if not crafting_used:\n",
    "            print(\"3. Создать предмет (не тратит день)\")\n",
    "            busy_wait(40000000)\n",
    "\n",
    "        # при починке радара можем его запустить\n",
    "        if \"радар\" not in player_state[\"capsule_status\"][\"requires_repairs\"] and player_state[\"capsule_status\"][\"status\"] == \"отремонтирована.\":\n",
    "            if not crafting_used:\n",
    "                print(\"4. Запустить радар\")\n",
    "            else:\n",
    "                print(\"3. Запустить радар\")\n",
    "            busy_wait(40000000)\n",
    "\n",
    "        # при починке всей капсулы мы можем отправить сигнал бедствия, что ведёт к хорошей концовке\n",
    "        if player_state[\"capsule_status\"][\"status\"] == \"отремонтирована.\" and \"радио\" not in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "            if not crafting_used:\n",
    "                print(\"5. Отправить сигнал бедствия\")\n",
    "            else:\n",
    "                print(\"4. Отправить сигнал бедствия\")\n",
    "            busy_wait(40000000)\n",
    "        \n",
    "        extra_choice = input(\"Введите номер действия: \").strip()\n",
    "\n",
    "        # исследовать местность (в т. ч. пещеру) и собирать ресы можно в любой день\n",
    "        if extra_choice == \"1\":\n",
    "            print(\"\\nВы решаете исследовать местность.\")\n",
    "            busy_wait(40000000)\n",
    "            if random.random() < 0.2:\n",
    "                print(\"\\nВнезапно на вас нападает подводный хищник!\")\n",
    "                if spisok_resursov[\"аптечки\"] > 0:\n",
    "                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                    print(\"Вы использовали аптечку и избежали урона.\")\n",
    "                else:\n",
    "                    player_state[\"food\"] -= 20\n",
    "                    print(\"У вас не было аптечек, и хищник нанёс вам урон. В борьбе с ним вы потеряли много энергии. Вы потеряли 20% еды.\")\n",
    "                    if player_state[\"food\"] <= 0:\n",
    "                        print(\"В борьбе с хищником вы потеряли много энергии. Вы умерли от недостатка сил после атаки. Игра окончена.\")\n",
    "                        exit()\n",
    "            print(\"Прямо сейчас вы можете сосредоточиться на исследовании местности: растений, рыб, доступных ископаемых. Либо сосредоточиться исключительно на сборе ресурсов.\")\n",
    "            busy_wait(40000000)\n",
    "            print(\"1. Изучать местность.\\n2. Собирать ресурсы\")\n",
    "       \n",
    "            while True:\n",
    "                true_extra_choice = input(\"Введите номер действия: \").strip()\n",
    "                if true_extra_choice == \"2\":\n",
    "                    print(\"\\nВы решаете собирать ресурсы.\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"Вокруг, на дне и на склонах подводных гор можно увидеть различные камни. А чуть дальше зеленеют высокие, длинные водоросли.\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"Если проплыть чуть дальше, можно собрать кораллы, которые могут пригодиться в починке основных модулей капсулы.\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"Чем вы займетесь в первую очередь: добычей камней (если очистить их от примесей, вы сможете получить полезные материалы); собиранием кораллов или поплывёте за водорослями?\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"1. Собирать камни.\\n2. Нарезать кораллы.\\n3. Поплыть за водорослями.\")\n",
    "                    while True:\n",
    "                        second_true_extra_choice = input(\"Введите номер действия: \").strip()\n",
    "                        if second_true_extra_choice == \"1\":\n",
    "                            print(\"Вам удается найти несколько камней, содержащих железо и медь.\")\n",
    "                            spisok_resursov[\"медь\"] += 2\n",
    "                            spisok_resursov[\"железо\"] += 2\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"У вас еще есть возможность собрать водоросли или кораллы.\")\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"1. Нарезать кораллы.\\n2. Поплыть за водорослями.\")\n",
    "                            while True:\n",
    "                                third_true_extra_choice = input(\"Введите номер действия: \").strip()\n",
    "                                if third_true_extra_choice == \"1\":\n",
    "                                    print(\"Вы успешно срезаете несколько пластин коралла.\")\n",
    "                                    spisok_resursov[\"кораллы\"] += 2\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                elif third_true_extra_choice == \"2\":\n",
    "                                    print(\"Вы успешно срезаете несколько стеблей водорослей.\")\n",
    "                                    spisok_resursov[\"водоросли\"] += 2\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                else:\n",
    "                                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                        elif second_true_extra_choice == \"2\":\n",
    "                            print(\"Вы успешно срезаете несколько пластин коралла.\")\n",
    "                            spisok_resursov[\"кораллы\"] += 2\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"У вас еще есть возможность собрать водоросли или камни.\")\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"1. Собирать камни.\\n2. Поплыть за водорослями.\")\n",
    "                            while True:\n",
    "                                fourth_true_extra_choice = input(\"Введите номер действия: \").strip()\n",
    "                                if fourth_true_extra_choice == \"1\":\n",
    "                                    print(\"Вам удается найти несколько камней, содержащих железо и медь.\")\n",
    "                                    spisok_resursov[\"медь\"] += 2\n",
    "                                    spisok_resursov[\"железо\"] += 2\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                elif fourth_true_extra_choice == \"2\":\n",
    "                                    print(\"Вы успешно срезаете несколько стеблей водорослей.\")\n",
    "                                    spisok_resursov[\"водоросли\"] += 2\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                else:\n",
    "                                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                        elif second_true_extra_choice == \"3\":\n",
    "                            print(\"Вы успешно срезаете несколько стеблей водорослей.\")\n",
    "                            spisok_resursov[\"водоросли\"] += 2\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"У вас еще есть возможность собрать камни или кораллы.\")\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"1. Нарезать кораллы.\\n2. Собирать камни.\")\n",
    "                            while True:\n",
    "                                fifth_true_extra_choice = input(\"Введите номер действия: \").strip()\n",
    "                                if fifth_true_extra_choice == \"1\":\n",
    "                                    print(\"Вы успешно срезаете несколько пластин коралла.\")\n",
    "                                    spisok_resursov[\"кораллы\"] += 2\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                elif fifth_true_extra_choice == \"2\":\n",
    "                                    print(\"Вам удается найти несколько камней, содержащих железо и медь.\")\n",
    "                                    spisok_resursov[\"медь\"] += 2\n",
    "                                    spisok_resursov[\"железо\"] += 2\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                else:\n",
    "                                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                        else:\n",
    "                            print('Ошибка ввода. Введите \"1\", \"2\" или \"3\".')\n",
    "                        break\n",
    "                    print(\"С помощью небольших скоплений водорослей вам удаётся создать импровизированную сеть. Благодаря ней вы ловите несколько рыб.\")\n",
    "                    busy_wait(40000000)\n",
    "                    \n",
    "                    food_found = random.randint(10, 25)\n",
    "                    player_state[\"food\"] += food_found\n",
    "                    if player_state[\"food\"] > 100:\n",
    "                        player_state[\"food\"] = 100\n",
    "                    print(f\"Вам удалось поймать рыбу и восстановить {food_found}% запаса еды!\")\n",
    "                    busy_wait(40000000)\n",
    "                    \n",
    "                    print(\"Стало темнеть. Пора возвращаться в капсулу.\")\n",
    "                    busy_wait(100000000)\n",
    "                    break\n",
    "                \n",
    "                elif true_extra_choice == \"1\":\n",
    "                    print(\"Вы решаете изучить местность вокруг.\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"Вы замечаете, что некоторые растения испускают слабое свечение, а мелкие рыбки не боятся вас.\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"Вдали вы замечаете нечто интересное — возможно, вход в подводную пещеру.\")\n",
    "                    busy_wait(40000000)\n",
    "                    print(\"1. Исследовать\\n2. Вернуться в капсулу\")\n",
    "                    new_investigate_choice = input(\"Введите номер действия: \").strip()\n",
    "                    if new_investigate_choice == \"1\":\n",
    "                        print(\"Вы подплываете ближе.\")\n",
    "                        busy_wait(40000000)\n",
    "                        if player_state[\"oxygen_tank\"]:\n",
    "                            print(\"С кислородным баллоном вы погружаетесь и находите пещеру с ресурсами.\")\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"В глубине пещеры обитает крупный хищник.\")\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"у вас всё ещё есть возможность вернуться.\")\n",
    "                            busy_wait(40000000)\n",
    "                            while True:\n",
    "                                vybor = input(\"1. Вернуться домой(скорее всего перед встречей с хищником может понадобиться обзавестись оружием)\\n2. Рискнуть\" ).strip()\n",
    "                                if vybor == \"1\":\n",
    "                                    print(\"Вы возвращаетесь в капсулу.\")\n",
    "                                    busy_wait(40000000)\n",
    "                                    break\n",
    "                                elif vybor == \"2\":\n",
    "                                    print(\"Вы спускаетесь в пещеру.\")\n",
    "                                    busy_wait(40000000)\n",
    "                                    chance = random.random()\n",
    "                                    if spisok_resursov[\"нож\"] >= 1:\n",
    "                                        if chance < 0.6:\n",
    "                                            print(\"\\nВнезапно на вас нападает подводный хищник!\")\n",
    "                                            if spisok_resursov[\"аптечки\"] > 0:\n",
    "                                                glupyi_vybor = input(\"использовать аптечку? (1. да; 2. нет.)\").strip()\n",
    "                                                if glupyi_vybor == \"1\":\n",
    "                                                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                                                    print(\"Вы использовали аптечку и избежали урона.\")\n",
    "                                                elif glupyi_vybor == \"2\":\n",
    "                                                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                                                    print(\"Глупый выбор, вы всё равно использовали аптечку, так как инстинкт самосохранения оказался сильнее\")\n",
    "                                                else:\n",
    "                                                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                                            else:\n",
    "                                                print(\"Вы умерли после атаки. Игра окончена.\")\n",
    "                                                exit()\n",
    "                                        elif 0.6 <= chance <= 0.8:\n",
    "                                            print(\"Вам удаётся отпугнуть хищника, но вы всё равно не можете добраться до скопления ресурсов на дне пещеры.\")\n",
    "                                        elif chance > 0.8:\n",
    "                                            print(\"Вам удаётся убить хищника и собрать немного ресурсов со дна пещеры.\")\n",
    "                                            spisok_resursov[\"магнетит\"] += 1\n",
    "                                            spisok_resursov[\"алмазы\"] += 1\n",
    "                                            \n",
    "                                            food_found = random.randint(20, 35)\n",
    "                                            player_state[\"food\"] += food_found\n",
    "                                            if player_state[\"food\"] > 100:\n",
    "                                                player_state[\"food\"] = 100\n",
    "                                            print(f\"Вы разделали тушу хищника и смогли добыть пищи, восстановив {food_found}% запаса еды!\")\n",
    "                                            \n",
    "                                            item_kill += 1\n",
    "                                            busy_wait(40000000)\n",
    "                                    elif spisok_resursov[\"острый раскалённый нож\"] >= 1:\n",
    "                                        if chance < 0.3:\n",
    "                                            print(\"\\nВнезапно на вас нападает подводный хищник!\")\n",
    "                                            if spisok_resursov[\"аптечки\"] > 0:\n",
    "                                                glupyi_vybor = input(\"использовать аптечку? (1. да; 2. нет.)\").strip()\n",
    "                                                if glupyi_vybor == \"1\":\n",
    "                                                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                                                    print(\"Вы использовали аптечку и избежали урона.\")\n",
    "                                                elif glupyi_vybor == \"2\":\n",
    "                                                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                                                    print(\"Глупый выбор, вы всё равно использовали аптечку, так как инстинкт самосохранения оказался сильнее\")\n",
    "                                                else:\n",
    "                                                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                                            else:\n",
    "                                                print(\"Вы умерли после атаки. Игра окончена.\")\n",
    "                                                exit()\n",
    "                                        \n",
    "                                        elif 0.3 <= chance <= 0.5:\n",
    "                                            print(\"Вам удаётся отпугнуть хищника, но вы всё равно не можете добраться до скопления ресурсов на дне пещеры.\")\n",
    "                                        elif chance > 0.5:\n",
    "                                            print(\"Вам удаётся убить хищника и собрать немного ресурсов со дна пещеры.\")\n",
    "                                            spisok_resursov[\"магнетит\"] += 1\n",
    "                                            spisok_resursov[\"алмазы\"] += 1\n",
    "                                            \n",
    "                                            food_found = random.randint(20, 35)\n",
    "                                            player_state[\"food\"] += food_found\n",
    "                                            if player_state[\"food\"] > 100:\n",
    "                                                player_state[\"food\"] = 100\n",
    "                                            print(f\"Вы разделали тушу хищника и смогли добыть пищи, восстановив {food_found}% запаса еды!\")\n",
    "                                            \n",
    "                                            item_kill += 1\n",
    "                                            busy_wait(40000000)\n",
    "                                    else:\n",
    "                                        if chance < 0.8:\n",
    "                                            print(\"\\nВнезапно на вас нападает подводный хищник!\")\n",
    "                                            if spisok_resursov[\"аптечки\"] > 0:\n",
    "                                                glupyi_vybor = input(\"использовать аптечку? (1. да; 2. нет.)\").strip()\n",
    "                                                if glupyi_vybor == \"1\":\n",
    "                                                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                                                    print(\"Вы использовали аптечку и избежали урона.\")\n",
    "                                                elif glupyi_vybor == \"2\":\n",
    "                                                    spisok_resursov[\"аптечки\"] -= 1\n",
    "                                                    print(\"Глупый выбор, вы всё равно использовали аптечку, так как инстинкт самосохранения оказался сильнее\")\n",
    "                                                else:\n",
    "                                                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "                                            else:\n",
    "                                                print(\"Вы умерли после атаки. Игра окончена.\")\n",
    "                                                exit()\n",
    "                                        elif 0.8 <= chance:\n",
    "                                            print(\"Вам удается увернуться от атаки и ретировться из пещеры\")\n",
    "                                break\n",
    "                            player_state[\"has_visited_cave\"] = True\n",
    "                            busy_wait(40000000)\n",
    "                        else:\n",
    "                            print(\"Без кислородного баллона вы не можете дышать под водой.\")\n",
    "                            busy_wait(40000000)\n",
    "                            print(\"Вы теряете сознание и умираете. Игра окончена.\")\n",
    "                            exit()\n",
    "                    elif new_investigate_choice == \"2\":\n",
    "                        print(\"Вы возвращаетесь в капсулу.\")\n",
    "                        busy_wait(40000000)\n",
    "                    print(\"День подошёл к концу.\")\n",
    "                    busy_wait(100000000)\n",
    "                    break\n",
    "                else:\n",
    "                    print('Ошибка ввода. Введите \"1\" или \"2\".')\n",
    "            break\n",
    "\n",
    "        # на второй день появляется возможность чинить системы капсулы\n",
    "        elif extra_choice == \"2\":\n",
    "            if player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                print(\"Какую систему чинить?\")\n",
    "                print(\"1. Радио (1 микросхема, 2 медь, редкие ресурсы)\")\n",
    "                print(\"2. Радар (1 микросхема, 2 железо, 1 магнетит)\")\n",
    "                print(\"3. Изготовитель аптечек (1 микросхема, 1 синтетические волокна)\")\n",
    "                print(\"4. починить капсулу (2 медь, 2 железо, 1 микросхема, 1 алмаз, 1 магнетит, редкие ресурсы)\")\n",
    "                repair_choice = input(\"Введите номер: \").strip()\n",
    "                if repair_choice == \"1\" and \"радио\" in player_state[\"capsule_status\"][\"requires_repairs\"] and player_state[\"capsule_status\"][\"status\"] == \"отремонтирована.\":\n",
    "                    if spisok_resursov[\"микросхема\"] >= 1 and spisok_resursov[\"медь\"] >= 2 and spisok_resursov[\"редкие ресурсы\"] >= 1:\n",
    "                        spisok_resursov[\"микросхема\"] -= 1\n",
    "                        spisok_resursov[\"медь\"] -= 2\n",
    "                        spisok_resursov[\"редкие ресурсы\"] -= 1\n",
    "                        player_state[\"capsule_status\"][\"requires_repairs\"].remove(\"радио\")\n",
    "                        print(\"Радио отремонтировано!\")\n",
    "                        busy_wait(40000000) \n",
    "                    else:\n",
    "                        print(\"Недостаточно ресурсов. В попытках хоть что-то исправить или починить вы провели весь день, вам стоит лучше рассчитывать время.\")\n",
    "                elif repair_choice == \"1\" and \"радио\" not in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                    print(\"Радио функционирует!\")\n",
    "                    \n",
    "                elif repair_choice == \"2\" and \"радар\" in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                    if spisok_resursov[\"микросхема\"] >= 1 and spisok_resursov[\"железо\"] >= 2 and spisok_resursov[\"магнетит\"] >= 1:\n",
    "                        spisok_resursov[\"микросхема\"] -= 1\n",
    "                        spisok_resursov[\"железо\"] -= 2\n",
    "                        spisok_resursov[\"магнетит\"] -= 1\n",
    "                        player_state[\"capsule_status\"][\"requires_repairs\"].remove(\"радар\")\n",
    "                        print(\"Радар отремонтирован!\")\n",
    "                        busy_wait(40000000)\n",
    "                    else:\n",
    "                        print(\"Недостаточно ресурсов. В попытках хоть что-то исправить или починить вы провели весь день, вам стоит лучше рассчитывать время.\")\n",
    "                elif repair_choice == \"2\" and \"радар\" not in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                    print(\"Радар функционирует!\")\n",
    "                    \n",
    "                elif repair_choice == \"3\" and \"изготовитель аптечек\" in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                    if spisok_resursov[\"микросхема\"] >= 1 and spisok_resursov[\"синтетические волокна\"] >= 1:\n",
    "                        spisok_resursov[\"микросхема\"] -= 1\n",
    "                        spisok_resursov[\"синтетические волокна\"] -= 1\n",
    "                        player_state[\"capsule_status\"][\"requires_repairs\"].remove(\"изготовитель аптечек\")\n",
    "                        print(\"Изготовитель аптечек отремонтирован!\")\n",
    "                        busy_wait(40000000)\n",
    "                    else:\n",
    "                        print(\"Недостаточно ресурсов. В попытках хоть что-то исправить или починить вы провели весь день, вам стоит лучше рассчитывать время.\")\n",
    "                elif repair_choice == \"3\" and \"изготовитель аптечек\" not in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                    print(\"Изготовитель аптечек функционирует!\")\n",
    "                    \n",
    "                elif repair_choice == \"4\" and player_state[\"capsule_status\"][\"status\"] == \"сломана.\":\n",
    "                    if spisok_resursov[\"микросхема\"] >= 1 and spisok_resursov[\"медь\"] >= 2 and spisok_resursov[\"редкие ресурсы\"] >= 1 and spisok_resursov[\"железо\"] >= 2 and spisok_resursov[\"магнетит\"] >= 1 and spisok_resursov[\"алмазы\"] >= 1:\n",
    "                        spisok_resursov[\"микросхема\"] -= 1\n",
    "                        spisok_resursov[\"медь\"] -= 2\n",
    "                        spisok_resursov[\"редкие ресурсы\"] -= 1\n",
    "                        spisok_resursov[\"железо\"] -= 2\n",
    "                        spisok_resursov[\"магнетит\"] -= 1\n",
    "                        spisok_resursov[\"алмазы\"] -= 1\n",
    "                        player_state[\"capsule_status\"][\"status\"] = \"отремонтирована.\"\n",
    "                        print(\"Капсула отремонтирована!\")\n",
    "                        busy_wait(40000000)\n",
    "                    else:\n",
    "                        print(\"Недостаточно ресурсов. В попытках хоть что-то исправить или починить вы провели весь день, вам стоит лучше рассчитывать время.\")\n",
    "                elif repair_choice == \"4\" and player_state[\"capsule_status\"][\"status\"] != \"сломана.\":\n",
    "                    print(\"Капсула функционирует!\")\n",
    "            break\n",
    "\n",
    "        # если выбрали создать предмет:\n",
    "        elif extra_choice == \"3\" and not crafting_used:\n",
    "            print(\"Что создать?\")\n",
    "            print(\"1. Микросхема (2 коралла, 2 меди)\")\n",
    "            print(\"2. Кислородный баллон (2 железа)\")\n",
    "            print(\"3. Нож (2 железа)\")\n",
    "            print(\"4. Острый раскалённый нож (1 нож, 1 алмаз, 1 микросхема)\")\n",
    "            print(\"5. Аптечки (1 синтетическое волокно)\")\n",
    "            print(\"6. Переработать водоросли в волокна (2 водоросли)\")\n",
    "            print(\"7. Жареная рыба (1 водоросль) - восстановит 20% еды\")\n",
    "            print(\"8. Питательный коктейль (2 водоросли) - восстановит 30% еды\")\n",
    "            print(\"9. Консервы из морепродуктов (1 водоросль, требуется нож) - восстановит 25% еды\")\n",
    "            print(\"0. Вернуться назад.\")\n",
    "            \n",
    "            craft_choice = input(\"Введите номер (0 - для возврата): \").strip()\n",
    "            if craft_choice == \"0\":\n",
    "                print(\"Возврат в основное меню.\")\n",
    "                continue\n",
    "            elif craft_choice == \"1\":\n",
    "                if craft_item(\"микросхема\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"2\":\n",
    "                if craft_item(\"кисл баллон высокой ёмкости\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"3\":\n",
    "                if craft_item(\"нож\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"4\":\n",
    "                if craft_item(\"острый раскалённый нож\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"5\":\n",
    "                if craft_item(\"аптечки\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"6\":\n",
    "                if craft_item(\"синтетические волокна\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"7\":\n",
    "                if craft_item(\"жареная рыба\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"8\":\n",
    "                if craft_item(\"питательный коктейль\"):\n",
    "                    crafting_used = True\n",
    "            elif craft_choice == \"9\":\n",
    "                if spisok_resursov.get(\"нож\", 0) > 0:\n",
    "                    if craft_item(\"консервы из морепродуктов\"):\n",
    "                        crafting_used = True\n",
    "                else:\n",
    "                    print(\"Вам нужен нож для приготовления консервов!\")\n",
    "            else:\n",
    "                print(\"Неверный выбор.\")\n",
    "\n",
    "        # если выбрали запустить радар:\n",
    "        elif (extra_choice == \"4\" and not crafting_used) or (extra_choice == \"3\" and crafting_used):\n",
    "            if \"радар\" not in player_state[\"capsule_status\"][\"requires_repairs\"] and player_state[\"capsule_status\"][\"status\"] == \"отремонтирована.\":\n",
    "                print(\"Вы активируете радар...\")\n",
    "                busy_wait(40000000)  \n",
    "\n",
    "                # с шансом 1 к 2 радар может обнаружить редкие ресурсы, необходимые для финальной починки капсулы\n",
    "                if random.random() < 0.5:\n",
    "                    print(\"Радар обнаружил скопление редких ресурсов неподалёку!\")\n",
    "                    spisok_resursov[\"редкие ресурсы\"] += 1 \n",
    "                else:\n",
    "                    print(\"Радар не обнаружил ничего интересного.\")\n",
    "                break\n",
    "            else:\n",
    "                print(\"Неверный выбор.\")\n",
    "\n",
    "        # если выбрали отправить сигнал бедствия:\n",
    "        elif (extra_choice == \"5\" and not crafting_used) or (extra_choice == \"4\" and crafting_used):\n",
    "            if player_state[\"capsule_status\"][\"status\"] == \"отремонтирована.\" and \"радио\" not in player_state[\"capsule_status\"][\"requires_repairs\"]:\n",
    "                print(\"\\nСигнал бедствия отправлен. Вы выжили! Игра окончена.\")\n",
    "                exit()\n",
    "            else:\n",
    "                print(\"Неверный выбор.\")\n",
    "        \n",
    "        else:\n",
    "            print(\"Неверный выбор.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2ffa12e1-e4c1-4126-a998-0285960ba96e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dc3f16ac-7198-4d08-b7fb-b8b71463c43e",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
